import { cn } from "@/lib/utils";
import { Axe, Backpack, Book, Leaf, ScrollText } from "lucide-react";
import Link from "next/link";



export default function AncRulesPg() {


    const arr = [
         
        { text:`  
        Ты раскаиваешься о нераскаявшихся и говоришь о Мудрости?
         Мудрые не скорбят о мертвых и живых.
         `},
         { text:`
        
        Ни я, ни ты, ни эти правители людей никогда не существовали.
        И не будет нас всех после. Мы все выше этого.
        `},
        { text:`
       
        В этом теле воплощенного: детство, юность и старость — все одно и то же.
        Точно так же терпеливый человек, достигший другого тела, не обманывается им.
        `},
        { text:`
      
        Прикосновения материи, Каунтея, холодные и горячие, приятные и болезненные.
        Терпи их, кто приходит и уходит и непостоянен, Бхарат.
        `},
        { text:`
       
        Того кого они не тревожат - мужчина, бык из мужчин.
        Кто стойко переносит как боль, так и удовольствие, готов к бессмертию. 
        `},
        { text:`
        
        В неистинном нет бытия, вне бытия нет истины.
        Глубина обоих была увидена провидцами истины.
        `},
        { text:`
        
        Неразрушимость тогда видеться во всём, чем всё это пронизано.
        Разрушить неисчерпаемое никто не может. (истину)
        `},
        { text:`
        
        Имея бренные тела, постоянно воплощаются души
        Неуничтожимые и неизмеримые. Поэтому присоединяйся к битве Бхарат! 
        `},
        { text:`
       
        Тот, кто считает себя убийцей, 
        И тот, кто думает, что он убит,
        Оба не видят, не знают. 
        Он не убивает и его не убивают.
        `},
        { text:`
      
        Ни живо не мертво никогда.
        Ни в прошлом, ни в будущем.
        Нерожденное, постоянное, вечное, древнее
        Его не убивают в теле, которое убивают.
        `},
        { text:`
     
        Понимая неразрушимое постоянство, их нерожденность и неисчерпаемость
        Каким образом человек, Партх, может убить или быть убитым?
        `},
        { text:`
     
        Не только изношенную одежду
        Человек окутывает себя новыми 
        И телами, старые отбрасывая
        Отождествляясь с положением в новых телах
        `},
        { text:`
      
        Оружие не может его поразить. Огонь его не обжигает.
        И вода его не смачивает. Ветер его не сушит.
        `},
        { text:`
    
        Неразрезать его, Несжечь его, Невымыть его. Невысушить его.
        Постоянное и вездесуще. Стабильное и неподвижное Оно.
        `},
        { text:`
    
        Это непроявленно и непостежимо умом. Неизменное - так учат.
        Осознавая и Видя это. Ты не должен об этом раскаиваться.
        `},
        { text:`
      
        И так цепь постоянства жизни и постоянства понимая смерти.
        Таким образом ты Могучерукий. Не должен раскаиваться.
        `},
        { text:`
      
        Рожденные, очевидно, умрут. Очевидно, рождается мертвое.
        В том что неизбежно - нет смысла раскаиваться.
        `},
        { text:`
      
        Непроявленные сознания явленны промежуточно.
        Какое сожаление может быть о их непроявленных смертях?
        `},
        { text:`
     
        В замешательстве, те кто познают их, многочисленные
        В замешательстве, те кто пытаются рассказывать о них.
        В замешательстве те кому рассказывают о них.
        Но даже те, кто услышали они не знают объективно -
        `},
        { text:`
   
        Это воплощенное вечно бессмертное во всех телах.
        И так за ВСЕ сознания, не тебе раскаиваться.
        `},


        { text:`
И о своём долге припомнив, ты не должен колебаться.
Ведь изначальный Долг кшатрия – сражение, иного неведомо.
`},
{ text:`
Удачливо, даже не осознавая - они открывают врата рая.
Счастливые Кшатрии, Партха, Вступившие в войну.
`},
{ text:`

Но если ты рассудишь, что Долг твой бездействие.
Тогда своим Долгом, и честью тоже, пав - греха достигнешь. 
`},
{ text:`

Бесчестный! Так сознания о тебе скажут вечные.
А для сознательного человека – бесчестию смерть предпочтительнее.
`},
{ text:`

От страха он не сражается, Будут так рассуждать о тебе МахаРатхи.
И они многие решат о тебе, что сознание твоё пришло в легкомыслие.
`},
{ text:`

Доверчивое, ведомое большинство. Ведомое твоими недоброжелателями.
Станет осуждать твою искусность, того мучительнее, Что?
`},
{ text:`

Убитый достигнешь Небес, Выжив обретешь Величие.
Поэтому воспрянь, Каунтея, Сражайся расчетливо и решительно.
`},
{ text:`

Счастье – горе, сам планируя. Получу, неполучу, выживу не выживу.
Эта Битва ради самой Битвы. За это греха не обретают. 
`},
{ text:`

Это говорю я  Логически, Единым Разумом теперь скажу.
Разумом, с которым сражаясь, Партха, ты оковы кармы преодолеешь.
`},
{ text:`

В нём нет неудач, нет потерь, В нём противоречий не увидишь.
Даже небольшим следованием Дхарме с ним преодолеваются Великие Страхи.
`},
{ text:`

Решительной Души Разум – Целостен. Рождённый Куру.
Множество ответвлений неисчислимых в разумах нерешительных.
`},
{ text:`

В цветистом произношении слов, в которых они не углубились, соревнуясь в познании Вед. Партха. Таково их положение, 
ведомые Похотью Души, на Высших Планетах. 
`},
{ text:`

Родившись по карме, данной свыше. Действием ощущающих органов различных, много богатых, приятных путей пройти.
`},
{ text:`
Тот, кто поклоняется богатству и господству, у того затуманена память -
Разума Решительной Самодостаточной Души - не изведает.
`},
{ text:`

Три типа органов чувств познав, не отождествляйся с ними сознанием Арджуна!
Не двойственно, постоянно в благости прибывая, сострадателен будь к Душам в глубокой целостности. 
`},
{ text:`

Подобно тому как вся вода имеет свойства утолять жажду.
Так и Брахман Видит Единство - Во всех Ведах.
`},
{ text:`

Поступков высший изначальный мотив твой, но последствия никогда!
Не хоти последствии поступка земного, но и не привязывайся ты к бездействию.
`},
{ text:`

В Единстве находясь, совершай действия, ни к чему не привязываясь, Арджуна.
К совершенному и несовершенному одинаково относиться – этому учит Единство.
`},
{ text:`

На далекие расстояния огради свои поступки Целостностью Разума Дананджая! 
В Разуме найдя прибежище. Жалки последствия желаний.
`},
{ text:`

Сражающийся с разумом в жизни не хочет эту двоицу: привилегии и наказание.
От того в Единстве Сражайся. Целостные это совершенные в действиях. 
`},
{ text:`

Действуя в жизни разумно, они отбрасывают плоды - мудрецы.
От оков рождения освободившись, они избавляются от желания иметь тело.
`},
{ text:`

Когда через эти игры иллюзий, пробьётся решимостью разум.
Тогда ты будешь всё слышать как оно есть.
`},
{ text:`

Когда ты слышишь противоречия в писаниях, но остаешься стойкий.
В самодостаточном устойчивом разуме - тогда Единства ты достиг!
`},
{ text:`
Утверждённого в мудрости(знание без опыта) каков язык
Находящегося в Самодостаточности, Кешава
Устойчивый ум(дыхание) – в ком пробуждён?
В чем он сдержан? А в чем выразителен?
`},
{ text:`

Изживёт когда похоть 
Всю, Партх, Обитающую в уме
Душа только Душою удовлетворенная, 
Устойчивой в мудрости такую зовут.
`},
{ text:`

Чей ум в страданиях неподвижен
А счастье удерживать не пытается
Изживший страсть, страх и гнев
Тот устойчивый утвержденный(здравомыслящий) мудрец - так учат  
`},
{ text:`

Тот кто во всём, не хочет разнообразия, достигая комфорта и дискомфорта
Не обретая -  не ненавидит. Так мудрость развивается
`},
{ text:`

Когда он себя самообуздает - подобно черепахе с её конечностями 
Органов чувств и искусности в них - боясь. так мудрость развивается 
`},
{ text:`

Предметы чувств верно различаются постящимся телом
От вкуса отрекаясь, наблюдение вкуса высшего остается 
`},
{ text:`

Свои попытки, Каунтея, люди содержат в памяти
Но возбужденные чувства - хоронят Благочестие в уме
`},
{ text:`

Их все сдерживая, объединившись непромедлительно со мной 
Возвысься над своими чувствами – и начни мудрость развивать
`},
{ text:`

Вдыхая объекты человек, привычку пожинает
Из привычки пожинается желание, в желании семя гнева
`},
{ text:`

В гневе появляется предвзятость, предвзятость спутывает память(смеренное)
Памяти потеря – это потеря Разума, а без Разума – нет энергии
`},
{ text:`

От страсти и ненависти освободившись, через чувств и их объектов приходящие 
Душою контролируя, зная Душу. Благодати добивается.
`},
{ text:`

Благодать все несчастья уничтожает в результате
А тот кто ни о чём не просит очень скоро
Разум в должной степени утверждает
`},
{ text:`

Не существует Разума без объединения
Нет объединения в привязанностях
Нет в привязанностях покоя
В беспокойстве где счастье?
`},
{ text:`

Когда чувства ведут, тогда ум(ман - будущее) ничего не видит
Тогда и исчезает мудрость, ветром лодкой унесенной
`},
{ text:`

В этих реалиях, могучерукий, не позволяй ни одному утекать
Чувству происходящему от объектов чувств – так мудрость развивается
`},
{ text:`

В этой ночи всех сознаний - такой мудрец бодрствует. 
А когда все сознания пробуждаются, в такую ночь мудрец лишь наблюдает
`},
{ text:`

Воды моря полны и неподвижны когда они объединяются в океан. 
Так и желание успокаивается, когда останавливает течение в уме, 
(а не при их реализации)
`},
{ text:`

Отбросив различные желания, человек ни о чем не просит
Нет моего – Нет Эгоизма, так покой достигается 
`},
{ text:`

Это состояние истины, друг, не достигнув его ты распыляешься 
Тот кто удерживает такое состояние ума в окончании времён
- Истинные постоянные подвижники.
`},
{ text:`
В этом мире есть два типа послушания
Которые я уже упоминал
Объединившихся знанием через рассуждение, 
Объединившихся действием через единение. 
`},
{ text:`

Не совершая действий, человек не достигает бездействия.
Он также не достигает совершенства только через отречение.
(как результат рассуждения отказ, без опыта)
`},
{ text:`

И редкие испили в жизни действительное успокоение действия без последствий
Многие деяния бесконтрольны – порожденные качествами подсознания
`},
{ text:`

Память чувств остановив, но умом наблюдая их
Совершенствуются так Душою чувства в фантазировании – это учитывай
`},
{ text:`

Контролировать чувства умом пытается регулярно, Арджуна
В органах действий и связан действиями в отречении, 
такой возвышеннее
(его связи не обусловлены чувственными удовольствиями)
`},
{ text:`

Постоянны последствия твоих действий, действие лучше лицемерия
Телом (янтра) управление твоим не станет совершенным в бездействии
`},
{ text:`

Тот кто не смыслом Ягьи действует в этом мире сковывается последствиями
Действуй так, Каутея, в Духе Отрешения самообучайся
(Ягья это действие отточенное по памяти. От того Ягья это памятование о самом совершенном поступке, его воспевание и повторение)
`},
{ text:`

Жертвоприношениями людей создав, сразу же изрек Прародитель:
Не иначе размножайтесь и не иначе прибывайте в дыму похоти
`},
{ text:`

Медитируя на богов, вы становитесь с Богами, и они чувствуют Вас.
Вы достигнете высшего блага, если сопереживать друг другу.
`},
{ text:`

Достаток господа дан полубогам за их заслуги в Ягьях
Кто присваивает себе их плоды это - конечно же вор
`},
{ text:`



Плоды Ягьи вкушая умиротворенно
Освобождаются от всех осквернений
Едят иные лишь оболочку греховную
Такие готовят не с душою 
(без вдохновения от ягий)
`},
{ text:`

Пища(тела) состоит из элементов
Которые существуют благодаря дождям
Дождя причина это Ягьи (вдохновение)
Ягьи это память - сама суть 
`},
{ text:`

Память происходит под надзором Брахмы
В пространстве внутри его, и в его энергиях
Таким образом все пути ведут к Брахме
Значит он пронизывает и Ягью
`},
{ text:`

Это издревле установленный цикл, кто не учитывает его
Непогрешный лишь от эмоций (ощущений), бесполезно Партх жизнь проживает

`},
{ text:`

Тот кто Душою Самоудовлетворен, конечно же будет терпелив.
Душа такого, человека конечно же спокойна, и его нет смысла курировать. 
`},
{ text:`

Нет никакого смысла в том, что он сделал или не сделал и в каком количестве
И ни с одним сознанием множественном он не отождествляется 
`},
{ text:`

Таким образом не отождествляясь, постоянно действуй ради самого действия
Неотождествленно совершая поступки - Высшего достигает Человек
`},
{ text:`

Действием, а не иным, собирались совершенные, Джанакой и другими
В миру на собрания. Самостоятельно наблюдали и слушали они
`},
{ text:`

Что бы ни делал лучший, это делает и другой. 
И то что просвещенный Умом указывает – Мир это исполняет непреклонно
`},
{ text:`

Не Мне Партха совершать поступки в трех мирах
Но то что еще не произошло, должно произойти, и требует действий
`},
{ text:`

Если я не буду Благочестив отказавшись действовать из-за эмоций
Благочестивые Мужи Благочестие утратят за мной Партха всё. 
`},
{ text:`

Эти миры погибнут, если я не направлю их в действии. Я сам стану
Автором гибридизации и обременителем их потомков
`},
{ text:`

Привязанные к следствиям слепые ведут - наставляя так, Бхарата. 
Пусть дваждырожденные и неотождествленные, 
Желающие исцелить, соберут собрания.
`},
{ text:`

Это не должно дискутироваться среди бедственных Разумом, 
привязанных к следствиям. 
Пусть они будут завистливыми во всех действиях, и самообучаются 
`},
{ text:`

Подсознанием склоняет в соответствии со своими качествами ко всем действиям
Душа, одержимая эго, думает, что я – творец. И я себя контролирую.
`},
{ text:`
28
Видя это как оно есть, Могучерукий, разделяя качества (т.е. следствие) и поступок (т.е. память, причину) 
Следствие это всего лишь следствие в своей сути и оно само не созреет 
`},
{ text:`

Тот кто обманут следствиями подсознания и привязывается к следствиям
Его нет смысла курировать, не видящего, не троньте тугодума
`},
{ text:`

Мои же все поступки, в отречении и мотивированны лишь сверх душой
Без всяких ожиданий выгод для тела, осознанно сражайся, победив эту болезнь
`},


	







    ]


    return (
        <div className="flex justify-center  items-center ">
            <text className="mt-6">
                {arr.map((el, indx) => (
                    <div key={indx} className="mx-6"><p ><span className="text-xl font-extrabold text-primary mr-3"> Уровень  {indx + 1}</span>{el.text}</p><br/></div>
                ))}
                
            
            </text>
        </div>  
    )
}