import { cn } from "@/lib/utils";
import { Axe, Backpack, Book, Leaf, ScrollText } from "lucide-react";
import Link from "next/link";



export default function AncRulesPg() {


    const arr = [
        { text:`   11
        Ты раскаиваешься о нераскаявшихся и говоришь о Мудрости?
         Мудрые не скорбят о мертвых и живых.
        12
        Ни я, ни ты, ни эти правители людей никогда не существовали.
        И не будет нас всех после. Мы все выше этого.
        13
        В этом теле воплощенного: детство, юность и старость — все одно и то же.
        Точно так же терпеливый человек, достигший другого тела, не обманывается им.
        14
        Прикосновения материи, Каунтея, холодные и горячие, приятные и болезненные.
        Терпи их, кто приходит и уходит и непостоянен, Бхарат.
        15
        Того кого они не тревожат - мужчина, бык из мужчин.
        Кто стойко переносит как боль, так и удовольствие, готов к бессмертию. 
        16
        В неистинном нет бытия, вне бытия нет истины.
        Глубина обоих была увидена провидцами истины.
        17
        Неразрушимость тогда видеться во всём, чем всё это пронизано.
        Разрушить неисчерпаемое никто не может. (истину)
        18
        Имея бренные тела, постоянно воплощаются души
        Неуничтожимые и неизмеримые. Поэтому присоединяйся к битве Бхарат! 
        19
        Тот, кто считает себя убийцей, 
        И тот, кто думает, что он убит,
        Оба не видят, не знают. 
        Он не убивает и его не убивают.
        20
        Ни живо не мертво никогда.
        Ни в прошлом, ни в будущем.
        Нерожденное, постоянное, вечное, древнее
        Его не убивают в теле, которое убивают.
        21
        Понимая неразрушимое постоянство, их нерожденность и неисчерпаемость
        Каким образом человек, Партх, может убить или быть убитым?
        22
        Не только изношенную одежду
        Человек окутывает себя новыми 
        И телами, старые отбрасывая
        Отождествляясь с положением в новых телах
        23
        Оружие не может его поразить. Огонь его не обжигает.
        И вода его не смачивает. Ветер его не сушит.
        
        24
        Неразрезать его, Несжечь его, Невымыть его. Невысушить его.
        Постоянное и вездесуще. Стабильное и неподвижное Оно.
        25
        Это непроявленно и непостежимо умом. Неизменное - так учат.
        Осознавая и Видя это. Ты не должен об этом раскаиваться.
        26
        И так цепь постоянства жизни и постоянства понимая смерти.
        Таким образом ты Могучерукий. Не должен раскаиваться.
        27
        Рожденные, очевидно, умрут. Очевидно, рождается мертвое.
        В том что неизбежно - нет смысла раскаиваться.
        28
        Непроявленные сознания явленны промежуточно.
        Какое сожаление может быть о их непроявленных смертях?
        29
        В замешательстве, те кто познают их, многочисленные
        В замешательстве, те кто пытаются рассказывать о них.
        В замешательстве те кому рассказывают о них.
        Но даже те, кто услышали они не знают объективно -
        30
        Это воплощенное вечно бессмертное во всех телах.
        И так за ВСЕ сознания, не тебе раскаиваться.
                    `},






    ]


    return (
        <div className="flex justify-center  items-center ">
            <text className="mt-6">
                {arr.map((el, indx) => (
                    <div key={indx} className="mx-6"><p ><span className="text-xl font-extrabold text-primary mr-3">{indx + 1}</span>{el.text}</p><br/></div>
                ))}
                
            
            </text>
        </div>  
    )
}