import { cn } from "@/lib/utils";
import { Axe, Backpack, Book, Leaf, ScrollText } from "lucide-react";
import Link from "next/link";



export default function RulesPg() {


    const arr = [
        { text:"   Стандартно число образов витающих в лимбе = 20.                                                                  "},
        { text:"   В начале вдоха игроки стандартно разворачивают одну ману (стихию).                                                                  "},
        { text:"   Если в правилах написано, что игрок должен, что то сделать и не сделал. ДМ за это ответственность не несет.                    "},
        { text:"   Если член пати погибает, Лидер теряет опыт в соответсвии с его виной перед игроком как Лидера и Покровителя по мнению ДМ.    "},
        { text:"   Живые существа не властны над своей кармой.    "},
        { text:"   При взятии образа игрок обязан озвучить, что он видит на картинке другим игроках и ДМу. ДМ должен утвердить описание игрока.  "},
        { text:"   При создании заклинания его: Баланс, Действие, Эффект, Манакост и тд. Должно быть ратифицировано ДМмом.  "},
        { text:"   Заклинания произносяться на выдохах, кроме `мгновенных заклинаний` и заклинаний имеющих `Миг`."},
        { text:"   Обычные физические действия назначаются на выдохах.    "},
        { text:"   Уровень Междумирья определяется кубиком D20 с изображением стихий.    "},
        { text:"   Стадия Вдоха/Выдоха определяется кубиком D6 (Чётные-выдох, нечётные-вдох).   "},
        { text:"   Члены пати не могут получить больше опыта чем лидер. Разница в полученном опыте превращается в КАРМУ, за исполнение своего долга. Конверитует опыт ДМ.   "},
        { text:"   Боевой Дух Пати определяет ДМ.   "},
        { text:"   Х боевоего духа дает +Х к эффективности.   "},
        { text:"   Бонус от боевого Духа действует только на тех кто исполняет приказы Пати Лидера.  "},
        { text:"   При эксперементальном броске в константе: 1 - потеря заклинания; 2 - потеря половины маны (с округлением в большую сторону) потраченных на заклинание; 3-4 - провал заклинания; 5-17 - +X к эффективности, где Х равен числу на кубике; 18 - добавте одну ману любого цвета в пулл вашей маны; 19 - +24 к эффективности; 20 - +30 к эффективности;.   "},
        { text:"   Образы меняются на Ману, только с описанием игрока процесса сбора эсенции стихий из него.                            "},
        { text:"   Количество опыта полченного игроком считает и озвучивает ДМ.                       "},
        { text:"   ДМ обязуется быть беспристрастным.                   "},
        { text:"   Безответственность и неуважение к игре, другим игроками и к ДМу недопустимы.                "},
        { text:"   Игрок обязан отыгрывать своего персонажа. Уровень отыгрыша определяет ДМ.               "},
        { text:"   В мирах игроки ОБЯЗАНЫ следовать за Пати Лидером.              "},
        { text:"   Если игрок или несколько игроков не согластны с решением Пати Лидера, они могут бросить ему вызов в Междумирье за статус Пати Лидера. Те кто согластны с Пати Лидером сражаються за него.            "},
        { text:"   Каждый вызов на сражение Пати Лидера константно понижает его Лидерство на одну единицу.       "},
        { text:"   Выйти из Междумирья можно по знамению которые обязан озвучить ДМ. До озвучивания знамения выход из Лимба невозможен.     "},

    ]


    return (
        <div className="flex justify-center  items-center ">
            <text className="mt-6">
                {arr.map((el, indx) => (
                    <div className="mx-6"><p key={indx}><span className="text-xl font-extrabold text-primary mr-3">{indx + 1}</span>{el.text}</p><br/></div>
                ))}
                
            
            </text>
        </div>  
    )
}