import { cn } from "@/lib/utils";
import { Axe, Backpack, Book, Leaf, ScrollText } from "lucide-react";
import Link from "next/link";



export default function RulesPg() {


    const arr = [
        { text:"   Стандартно число картинок витающих в Слое образов = 20. В одном слое образов 5 эссенций маны.                                                         "},
        { text:"   В начале вдоха игроки стандартно разворачивают одну ману (стихию).                                                                  "},
        { text:"   Если в правилах написано, что игрок должен, что то сделать и не сделал. ДМ за это ответственность не несет.                    "},
        { text:"   Если член пати погибает, Лидер теряет опыт в соответствии с его виной перед игроком как Лидера и Покровителя по мнению ДМ.    "},
        { text:"   Живые существа не властны над своей кармой.    "},
        { text:"   При взятии образа игрок обязан озвучить, что он видит на картинке другим игроках и ДМу. ДМ должен утвердить описание игрока.  "},
        { text:"   При создании заклинания его: Баланс, Действие, Эффект, Манакост и тд. Должно быть ратифицировано ДМмом.  "},
        { text:"   Заклинания произноситься на выдохах, кроме `мгновенных заклинаний` и заклинаний имеющих `Миг`."},
        { text:"   Обычные физические действия назначаются на выдохах.    "},
        { text:"   Уровень Междумирья определяется кубиком D20 с изображением стихий.    "},
        { text:"   Стадия Вдоха/Выдоха определяется кубиком D6 (Чётные-выдох, нечётные-вдох).   "},
        { text:"   Члены пати не могут получить больше опыта чем лидер. Разница в полученном опыте превращается в КАРМУ, за исполнение своего долга. Конверитует опыт ДМ.   "},
        { text:"   Боевой Дух Пати определяет ДМ.   "},
        { text:"   Х боевого духа дает +Х к эффективности.   "},
        { text:"   Бонус от боевого Духа действует только на тех кто исполняет приказы Пати Лидера.  "},
        { text:"   При экспериментальном броске в константе: 1 - потеря заклинания; 2 - потеря половины маны (с округлением в большую сторону) потраченных на заклинание; 3-4 - провал заклинания; 5-17 - +X к эффективности, где Х равен числу на кубике; 18 - +18 эффективности и разверните всю ману потраченую на заклинание; 19 - +24 к эффективности; 20 - +30 к эффективности;.   "},
        { text:"   Образы меняются на Ману, только с описанием игрока процесса сбора эссенции стихий из него.                            "},
        { text:"   Количество опыта полученного игроком считает и озвучивает ДМ.                       "},
        { text:"   ДМ обязуется быть беспристрастным.                   "},
        { text:"   Игрок обязан отыгрывать своего персонажа. Уровень отыгрыша определяет ДМ.               "},
        { text:"   В мирах игроки ОБЯЗАНЫ следовать за Пати Лидером.              "},
        { text:"   Если игрок или несколько игроков не согласны с решением Пати Лидера, они могут бросить ему вызов в Междумирье за статус Пати Лидера. Те кто согласны с Пати Лидером сражаются за него.            "},
        { text:"   Каждый вызов на сражение Пати Лидера константно понижает его Лидерство на одну единицу.       "},
        { text:"   Выйти из Междумирья можно по знамению которые обязан озвучить ДМ. До озвучивания знамения выход из Лимба невозможен.     "},
        { text:"   Три вдоха и Три выдоха – это один цикл. Каждые три цикла происходит усиление Междумирья и является новый доминирующий образ и так же усилятся предыдущие.      "},
        { text:"   ДМ может ОБОСНОВАННО и обязательно объясняя и предупреждая игрока корректировать анкету персонажа. Основные мотивы: смерти, НЕ отыгрыш персонажа и др. обстоятельства.   "},
        { text:"   Чтобы приобрести навык заклинания требуется выбросить на экспериментальном броске  Х+1 раз Соответствующее уровню заклинание значение где Х это индекс по номеру Порога Эффективности заклинания где 1 это Новичек. Так же требуется прописать Якорь (эффекты, слова, жесты) который ознаменует Автокаст.   "},
        { text:"   Пороги Эффективности бывают: Новичек (5-9 эфф.), Ученик (10-15 эфф.), Адепт (15-20 эфф.), Эксперт (21-29 эфф.), Мастер (30-34 эфф.), ПолуБог (35-39 эфф.) , Бог (40+ эфф.).             "},
        { text:"   Порог Эффективности самого Междумирья растет каждые 3 цикла.          "},
        { text:"   Заклинания по своей мощности бывают: Мифические, Редкие, Необычные и Обычные.          "},
        { text:"   За сном, голодом, холодом, жаром - обязан следить игрок. ДМ же обязан давать лишь последствия от них в случае запущенности.          "},
        { text:"   Сонливость, голод, холод влияют на эффективность игрока.          "},
        { text:"   Экспериментальный бросок должен описываться игроком.         "},
        { text:"   При выходе из боя игрок обязан остаться лишь с количеством заклинаний и маны в количестве INT+2.         "},
        { text:"   Уровень Характеристики равен порогу эффективности по индексу где Новичек это 1.       "},
        { text:`   Пример эмоций стихий: Земля - Любовь(Похотливость - у злых); 
        Вода - Склонность к лжи и обману.   Дружелюбность и безконфликтность у добрых; Огонь - Гнев.  Прямота, Правдивость, Активная поддержка; 
        Воздух - Жадность без меры.  Любознательность; Пустота - Мстительность. Молчаливость, отрешенность - добрых;
        Игрок имеет право утвердить любую свою эмоцию в сердце своего героя у ДМ. 
        `},
        { text:"   Возможность зажжения запала искры в Междумирье определяет ДМ.       "},
        { text:"   У каждой стихии есть эмоция. Кто не отыгрывает эмоцию не удерживает эссенцию стихий.       "},
        { text:"   Вытащить Артефакт из Лмба можно влив в него свою Эссенцию при выходе.      "},
        { text:"   Для создания заклинания нужно обладать маной нужной для его произношения.      "},



    ]


    return (
        <div className="flex justify-center  items-center ">
            <text className="mt-6">
                {arr.map((el, indx) => (
                    <div key={indx} className="mx-6"><p ><span className="text-xl font-extrabold text-primary mr-3">{indx + 1}</span>{el.text}</p><br/></div>
                ))}
                
            
            </text>
        </div>  
    )
}