import { cn } from "@/lib/utils";
import { Axe, Backpack, Book, Leaf, ScrollText } from "lucide-react";
import Link from "next/link";



export default function RulesPg() {


    const arr = [
        { text:"   Стандартное число осколков миров (пузырей) соприкасающееся с сознанием 20.                                                 "},
        { text:"   В начале вдоха игроки стандартно разворачивают одну ману (стихию) и одино заклинание, артефакт, чары или иные заклинания.                                                                  "},
        { text:"   При взятии образа игрок обязан озвучивает, чт опо ему мнению происходит в этом мире или осколке мира. "},
        { text:"   Баланс созданных заклинаний решает ДМ. Так же ДМ может корректировать инбалансные заклинания.  "},
        { text:"   Заклинания произноситься на выдохах, кроме `мгновенных заклинаний` и заклинаний имеющих `Миг`."},
        { text:"   Обычные физические действия назначаются на выдохах.    "},
        { text:"   Чем больше не заземленная лока, тем сложнее ее поддерживать на плаву в океане Междумирья.    "},
        { text:"   Если Лока Тонкого Мира соединяется с физической, она заземляется и на много менее потребляет Оры, так как ее начинает кормить Владелец Мира.   "},
        { text:"   Стадия Вдоха/Выдоха определяется кубиком D6 (Чётные-выдох, нечётные-вдох).   "},
        { text:"   Х боевого духа дает +Х к эффективности. Боевой Дух  может присвоить ДМ на свое усмотрение и при наличии лидера у Группы игроков.  "},
        { text:"   При экспериментальном броске в константе: 1 - потеря заклинания; 2 - потеря половины маны (с округлением в большую сторону) потраченных на заклинание; 3-4 - провал заклинания; 5-17 - +X к эффективности, где Х равен числу на кубике; 18 - +18 эффективности и разверните всю ману потраченую на заклинание; 19 - +24 к эффективности; 20 - +30 к эффективности;.   "},
        { text:"   Что бы получить Ману из образа, нужно описать Где и Как проявлена в образе стихия которую хочет получить игрок.    "},
        { text:"   Количество Оров полученного игроком считает ДМ.               "},
        { text:"   Осознанный разрыв оболочки Рифта (пузыря) 12 Оров. Разрыв в случайном направлении стоит 8 Оров.        "},
        { text:"   Три вдоха и Три выдоха – это один цикл. Каждые три цикла происходит движение Образов Миров вниз на дно океана МультиВселенной.   "},
        { text:"     Что бы приобрести Автокаст заклинания нужно успешно произнести его Х+1 раз. Соответствующее уровню заклинание значение где Х это индекс по номеру Порога Эффективности заклинания где 1 это Новичок. Так же требуется прописать Якорь (эффекты, слова, жесты) который ознаменует Автокаст. "},

        { text:"   Пороги Эффективности бывают: Новичек (5-9 эфф.), Ученик (10-15 эфф.), Адепт (15-20 эфф.), Эксперт (21-29 эфф.), Мастер (30-34 эфф.), ПолуБог (35-39 эфф.) , Бог (40+ эфф.).             "},
        { text:"   Порог Эффективности самого Междумирья растет каждые 3 цикла.          "},
        { text:"   Заклинания по своей мощности бывают: Мифические, Редкие, Необычные и Обычные.          "},
        { text:"   Каждый экспериментальный бросок должен описываться игроком.         "},
        { text:"   При выходе из боя игрок обязан остаться лишь с количеством заклинаний и маны в количестве INT+2.         "},
        { text:"   Если Игрок не использовал образ до смещения пузырей он его теряет.        "},
        { text:"   Уровень Характеристики равен порогу эффективности по индексу где Новичек это 1.       "},
        { text:"   Оторваться от Мира можно за 108 Оров.  "},
        { text:"   Поддерживать Артефакты и чары в активности могут помочь драгоценные камни.  "},
        { text:"     "},
        { text:"   Для создания заклинания нужно обязатешльно обладать маной нужной для его произношения. И повернуть ее при создании.     "},
        { text:"   Навык интелектуалов - Подготовка, позволяет сотворять и изучать сложные заклинания без должного навыка в течении более долгого времени.    "},
        
     
        { text:"  CON - это плотность тонкого и выстроенного физического тела в размере CON x 2.   "},
        { text:"  Первая и всегда присутствующая единица здоровья это сознание, Душа. Потеряв крайнее здоровье, Душа покидает тело физическое или тонкое.   "},
        { text:"  Существуют заклинания которые наносят урон энергетическому телу. Так же есть заклинания, что палят и поворачивают ману. Будьте бдительны в бою.  "},
  
        { text:"  Одинаковые стихии не наносят урон этой же стихии, но могут быть преодолены уроном в тройном размере... Т.е. 4 урона огнем по одной единице огненного щита. Пробьют стихийный барьер в 3 ед. и отнимет одну единицу здоровья не повреждая 1 единицу щита.     "},
        { text:"  Состояние покоя постепенно восстанавливает ментальное тело.     "},
        { text:"  Стоимость прокачки Характеристик. 160, 320, 640, 1280, 2560. Полубога и Бога возможно получить только выполнив задание и при очень успешном расположении дел.    "},
        { text:"  Безхозной энергии не бывает. Потребляйте =)  "},
        { text:"  Добившись достаточного могущества и популярности, люди начнут вам поклонятся. Т.е. добровольно отдавать свои Оры и различные Дары за Вашу  Покровительство или решение их конкретной одной проблемы.  "},
        { text:"  Мольбы о помощи можно словаить в осколках миров (пузырях) в Лимбе (Разрыве между Мирами) .  "},




    ]


    return (
        <div className="flex justify-center  items-center ">
            <text className="mt-6">
                {arr.map((el, indx) => (
                    <div key={indx} className="mx-6"><p ><span className="text-xl font-extrabold text-primary mr-3">{indx + 1}</span>{el.text}</p><br/></div>
                ))}
                
            
            </text>
        </div>  
    )
}