import { cn } from "@/lib/utils";
import { Axe, Backpack, Book, Leaf, ScrollText } from "lucide-react";
import Link from "next/link";



export default function StartPg() {


    const arr = [
        { text:`
        
        Сны подвластны Вашей Воле. Каждый из Вас годами медитаций и ментальных усилий, научился преодолевать иллюзии снов заставив их подчиняться.
Но вскоре Вы узнали, что вы не одни такие. Не только Вы можете учиться, подселяться в тела и развивать своё сознание снами.
Одни развиваются в Локализации пространства, иные в Скорости, третьи в Дипломатии, одни входят во сны лишь за Знаниями или развитии Воли.
(Выбор бонусной Характеристики)
Переломным моментом стала встреча Ваших друзей из снов в реальном мире.
(Знакомство: Имя, пару фактов о себе и как относишься к снам)
И вот Вы вновь встретились за столом, что бы исследовать иные миры, не зная ничего о той роли которую должны сыграть в их судьбах.
        
        `},

        { text:`
        Перед Вами пласт снов. Эти образы содержат интересующие Вас: знания, тела, земли, артефакты, элементы, друзей, врагов и многое другое.
Для начала Вам нужно подселиться в тело Личности, что бы действовать в Иномирье. Вы будете его контролировать пока Ваша Воля доминирует над Волей владельца. (Выбор тела) (Снятие Пласта -5 Энергии)
Далее Вам нужно погрузиться воспоминания. Найти в глубинах памяти: что эта личность любит, что ненавидит и чем она уникальна, а так же её имя.
Нужно обнаружить какова её основная стихия, какие навыки есть и ключевые переломные моменты судьбы.

(Теперь создадим свои первые заклинания)
Создание заклинания состоит из таких шагов:
1. Выбор образа.
2. Погружение в осколок сна и оттачивание уровня умения в соответствии с доминирующей Характеристикой.
3. Ратификация эффекта заклинания и его перезарядки, потеря Воли в соответствии с Сложностью.
(Создание заклинания Новичка стоит 16 энергии, Ученика 64, Адепта 108, Эксперта 256, Мастера 1080)
(Возможно начать обучение и практику и закончить их позже в осколке сна, но для этого его нужно держать в памяти)

(Очки навыков)
Максимально количество очков навыков зависит от главенствующей для навыка характеристики (х*5)
Навыки можно припоминать в течении игрового процесса.
        `},

        
        { text:`
        (Формулировка цели)

После первичного воспоминания о жизни Личностей, генерируется их индивидуальная цель на игру. Достигая цели вы получаете бесценный опыт и мудрость, а Ваш подопечный желаемое.


Настало время создать Мир в котором будут происходить события.
Сейчас бросьте кубики на лист, что бы определить Геоаномальные и Геопатогенные зоны земли.

Далее посмотрите на осколки снов, и определите свое начальное место положение. Выберите вектор Вашего движения среди осколков снов.

Если никакое событие, место или обстоятельство Вас не привлекает, Вы можете сдвинуть пласт (цена 5 энергии с округлением в большую сторону при делении)

Теперь начинайте Ваше путешествие. Желаю Вам всем удачи!


        `},

        { text:`
        
        `},
        
    ]


    return (
        <div className="flex justify-center  items-center ">
            <text className="mt-6">
                {arr.map((el, indx) => (
                    <div key={indx} className="mx-6"><p ><span className="text-xl font-extrabold text-primary mr-3">{indx + 1}</span>{el.text}</p><br/></div>
                ))}
                
            
            </text>
        </div>  
    )
}