import { cn } from "@/lib/utils";
import { Axe, Backpack, Book, Leaf, ScrollText } from "lucide-react";
import Link from "next/link";



export default function StartPg() {


    const arr = [
        { text:`
        
        Сны подвластны Вашей Воле. Каждый из Вас годами медитаций и ментальных усилий, научился преодолевать иллюзии снов заставив их подчиняться.
Но вскоре Вы узнали, что вы не одни такие. Не только Вы можете учиться, подселяться в тела и развивать своё сознание снами.
(Выбор бонусной Характеристики: Оболочки, Знания (Интеллект), Ум (Восприятие), Чары (Харизма), Сила Воли)
Переломным моментом стала встреча Ваших друзей из снов в реальном мире.
(Знакомство: Имя, пару фактов о себе и как относишься к снам)
И вот Вы вновь встретились за столом, что бы исследовать иные миры, не зная ничего о той роли которую должны сыграть в их судьбах.
        
        `},

        { text:`
        Перед Вами Мир Идей. Идеи содержат интересующие Вас: знания, тела, земли, артефакты, элементы, друзей, врагов и многое другое в форме Утопий или Кошмаров.
Для начала Вам нужно вступить в симбиоз (или в паразитизм) с Образом Личности, что бы действовать в Иномирье. Вы будете его контролировать пока Ваша Воля доминирует над Волей владельца. (Выбор Идеи Тела) (Снятие Пласта -1 коробка)
Далее Вам нужно погрузиться воспоминания. Найти в глубинах памяти: что эта личность любит, что ненавидит и чем она уникальна, а так же её имя.
Нужно обнаружить какова её основная стихия, какие навыки есть и ключевые переломные моменты судьбы.

(Теперь создадим свои первые заклинания)
Создание заклинания состоит из таких шагов:
1. Выбор образа.
2. Погружение в осколок сна и оттачивание уровня умения в соответствии с доминирующей Характеристикой.
3. Ратификация эффекта заклинания и его перезарядки, потеря Воли в соответствии с Сложностью.
(Создание заклинания Новичка стоит 16 энергии, Ученика 64, Адепта 108, Эксперта 256, Мастера 1080)
(Возможно начать обучение и практику и закончить их позже в осколке сна, но для этого его нужно держать в памяти)

(Очки навыков)
Максимально количество очков навыков зависит от главенствующей для навыка характеристики (х*5)
Навыки можно припоминать в течении игрового процесса.
        `},

        
        { text:`
        
        (Формулировка цели и Формулировка Идеи Бога)

После первичного воспоминания о жизни Личностей, генерируется их индивидуальная цель на игру о которой они молили Свою Идею Бога. Достигая цели вы получаете бесценный опыт и мудрость, а Ваш подопечный желаемое.

Далее посмотрите на идеи, и определите свое начальное место положение. Выберите вектор Вашего движения среди осколков снов.

Если никакое событие, место или обстоятельство Вас не привлекает, Вы можете сдвинуть пласт (-1 коробка раз за игру)

Сознания бывают Светлые (Божественные), Тёмные (Дьявольские) и Тусклые. Сейчас Вы тусклые.  Крайние Архетипы: Солнце и Черные дыры.
Решайте Сами Вы деятели в форме Божественного Вмешательства или Дьявольской Одержимости. 

Теперь начинайте Ваше путешествие. Желаю Вам всем удачи!


        `},

        { text:`

            Боёвка.

            
        `},

        
        { text:`
        
        `},
        
    ]


    return (
        <div className="flex justify-center  items-center ">
            <text className="mt-6">
                {arr.map((el, indx) => (
                    <div key={indx} className="mx-6"><p ><span className="text-xl font-extrabold text-primary mr-3">{indx + 1}</span>{el.text}</p><br/></div>
                ))}
                
            
            </text>
        </div>  
    )
}