import { cn } from "@/lib/utils";
import { Axe, Backpack, Book, Leaf, ScrollText } from "lucide-react";
import Link from "next/link";

export default function StartPg() {
  const arr = [
    {
      text: `
        
        Сны подвластны Вашей Воле. Каждый из Вас годами медитаций и ментальных усилий, научился преодолевать иллюзии снов заставив их подчиняться.
Но вскоре Вы узнали, что вы не одни такие. Что миры снов связаны между собой. Вы обучались действовать в телах во снах развивая своё сознание.
Сейчас за это каждому из Вас начислено очко бонусной характеристики. 
(Знакомство: Имя, пару фактов о себе и как относишься к снам).
И вскоре все похождения в Ваших снах стали заканчиваться улыбкой на лице одного человека. Фёдоа. И очаровательной привлекательностью его спутницы Василисы. (fin/213)
Однажды они все таки позвонили в двери Вашей квартиры.
Реакции были разные одни чувствовали Шок иные Радость, третие равнодушно отнеслись к этому как к данности. Факт в том, что Вам предложили работу.
В оккультной правительственной организации "Пожиратели Кошмаров".
Вы как сейчас помните вступительную речь Фёдора и клятву, что Дали Вы при вступлении.


`,
    },

    {
      text: `
      "
      Наш мир не так крепок как кажется. На его идейную структуру всегда ведется посягательства из вне. Ежедневно сотни тысячь покидают его умирая и столько жде посещает рождаясь.
      И на страже этого процесса стоят "Пожиратели Кошмаров". Правительственная организация ведьм и магов посвятившая свою жизнь покою и балансу Мироздания и роли человечства в нём. 
      Мы люди взрослые обойдемся без предостережений и предупреждений.
      За нарушение Клятвы - Смерть. 
      Клянетесь ли Вы всегда служить человечеству и отстаивать Баланс в Земном Мире? 
      "
      
      Хорошо.
      
      
      Следуйте за мной в конференс зал. 
      
      Вопросы?
     
        `,
    },

    {
        text: `
           
      Если вопросов нет. 
      
      Для начала Вам нужно окрепнуть. В этом мире наши тела и возможности ограничены, но через проводников Воли мы можем обретать их могущество. 
      Отныне Вы моя кровная семья, поэтому я научу Вас как это делать.
      Входите в транс. Встретимся во сне, Василиса скурирует ваши сознания. 
          `,
      },

    {
      text: `
       Для начала ищем просящих... 
Перед Вами Мир Идей. Идеи содержат интересующие Вас: знания, тела, земли, артефакты, элементы, друзей, врагов и многое другое,
 что будет использовано в Сплетении Древа Судьбы Просящего.
Для начала Вам нужно осознать Личность, что воззвала к Вашей помощи. Вы будете его контролировать пока у него есть Вера в Вас.
Выберите направление идей (по верхней идее), в которую Вы погрузитесь. Так же Вы всегда можете обратиться к Верхнему слою Пласта Идей.
Далее Вам нужно погрузиться воспоминания. Найти в глубинах памяти: что эта личность любит, что ненавидит и чем она уникальна, а так же её имя. Нужно обнаружить какова её основная стихия, какие навыки есть и ключевые переломные моменты судьбы.
(1. Выбор Идеи Тела, 2. Выбор Мотивации и Анти Мотивации, а так же бонуса. 3. Начало Выстраивания Идеи Нитей Судьбы. 4. За каждую единицу нити судьбы Вы получаете очки, которые можно тратить на развитие Навыков и Создание Магических Карт. )
`,
    },

    {
      text: `
Формирование Дерева Судьбы. За кажде Вплетение в него Вы получаете Нить Судьбы.  `,
    },

    {
      text: `
Достигая цели вы получаете бесценный опыт и мудрость, а Ваш подопечный желаемое.  `,
    },

    {
      text: `
          Посмотрите на Идеи. Есть ли среди них Образы мест в которых бы Вы хотели побывать в Вашем путешествии, персонажи которых вы бы хотели встретить, 
          противники с которыми бы вы хотели померяться силами, навыки, заклинания или вещи. А так же цель которая удовлетворит чаянья Вашего Просящего. 
          `,
    },

    {
      text: `
(Теперь создадим свои первые заклинания)
Создание заклинания состоит из таких шагов:
1. Выбор Образа Идеи.
2. Описание Эффекта заклинания.
3. Ратификация эффекта заклинания: Редкость, манакост, Числовая формулировка эффекта,  Перезарядка. Потеря Воли или Нити Судьбы в соответствии со сложностью.
(Создание заклинания Новичка стоит 16 энергии, Ученика 64, Адепта 108, Эксперта 256, Мастера 1080) НС: 1,2,3...
(Возможно начать обучение и практику и закончить их позже в осколке сна, но для этого его нужно держать в памяти)  `,
    },
    {
      text: `
(Очки навыков)
Максимально количество очков навыков зависит от главенствующей для навыка характеристики (х*5)
Навыки можно припоминать в течении игрового процесса.  `,
    },
    {
      text: `
      Сейчас мы в Лимбе(Междумирье)
Теперь начинайте Ваше путь. Помните, наш мир гораздо весомее их миров от того Вы сильнее их всех. Ваша Воля это самое Важное, что у Вас есть. 
Теперь сформировав Древо Судьбы вмешиваються они (plist/SOI-142). Я не знаю кто они, Василиса говорит, что это Доля и Недоля из Славянской мифологии... прядильщицы судеб...
Желаю Вам удачи! Она Вам понадобиться. И на последок скажу. Уже долгое время не было новых Мироходцев. Вы очень нужны своему Миру.  `,
    },

    {
      text: `
        
        `,
    },
  ];

  return (
    <div className="flex justify-center  items-center ">
      <text className="mt-6">
        {arr.map((el, indx) => (
          <div key={indx} className="mx-6">
            <p>
              <span className="text-xl font-extrabold text-primary mr-3">
                {indx + 1}
              </span>
              {el.text}
            </p>
            <br />
          </div>
        ))}
      </text>
    </div>
  );
}
