import { cn } from "@/lib/utils";
import { Axe, Backpack, Book, Leaf, ScrollText } from "lucide-react";
import Link from "next/link";

export default function StartPg() {
  const arr = [
    {
      text: `
        
        Сны подвластны Вашей Воле. Каждый из Вас годами медитаций и ментальных усилий, научился преодолевать иллюзии снов заставив их подчиняться.
Вы обучались действовать в телах во снах развивая своё сознание.

И вот в Ваши сны регулярно начал приходить один и тот же человек, он задавал Вам ненавязчивые вопросы, мешая Вам веселиться во снах. 
Вы ничего не подозревая отвечали на вопросы лиж бы он поскорее отстал, думая, что это всего лишь сон. 

Однажды днём Вам позвонили, кому на работу, кому на учебу и попросили явиться по одному адресу. И вот Вы пришли. 
Вы и сами не заметили как Вас начали вести мягко, но насильно... в конференц зал и сказали ждать. 

(Знакомство: Имя, пару фактов о себе и как относишься к снам).


`,
    },

    {
      text: `
      Всем привет. Расслабтесь Все будет хорошо. Чаю кофе... Соков. 
      Меня зовут Тимофей. 
      Или Таэмин. Мы с Вами встречались во снах. =) (реакция)
 
      "
      Мы это Видим, Видим как люди приходят в тела уходят из тел, временн оили постоянно.
      Иногда в тела подселяются... Ну к пример Гитлер или Ванга...
      Однажды мы доказали спецлужбам, что обладаем способностями и с нами начали считатся. Теперь...
      Вы в оккультной правительственной организации "YoRha".

      Сейчас отряд Земли состоит из меня Тимура, имя во сне Таэмин. Вики - имя во сне Мизари, Дории и Омниэры. 
      Их к сожалению представить можно только во сне. Они слишком пекутся за свою безопасность. 
      В нашем физическом мире много слуг демонов и различных Божеств, 
      что не потерпят конкуренции своей Воле.
       В реальности мы никогда не встречались, но мы связаны и чувствуем друг друга из-за почтения клятвы которую дали. 
       И запомните с этого момента, никогда не разглашайте свои данные на Земле. Не важно захотите ВЫ к нам присоедениться или нет. Вы люди. А мы служим человечеству.
      Наш мир не так крепок как кажется. На его идейную структуру всегда ведется посягательства из вне. Ежедневно сотни тысячь покидают его умирая и столько жде посещает рождаясь.
      И на страже этого процесса стоит "YoRha". Правительственная организация ведьм и магов посвятившая свою жизнь покою и балансу Мироздания и роли человечства в нём. 


 
      Вопросы?

      Клянетесь ли Вы всегда служить человечеству и отстаивать Баланс в Земном Мире? 
      Слава Человечеству!
      "
    
     На самом деле я никудышний учитель =)
     Но я постраюсь)
     
        `,
    },

    {
      text: `
           
      
      Для начала Вам нужно окрепнуть. В этом мире наши тела и возможности ограничены, но на тонком плане это другое. Мы можем обретать тела, рисовать вещи, локации... 
      Отныне Вы моя кровная семья, поэтому я научу Вас как это делать.
      Входите в транс. Встретимся во сне, Вика скурирует ваши сознания. 
          `,
    },

    {
      text: `
       Это Лимб. Пустота. Пространство между планетами. 
В нём витает тонкий Мир Идей. Идеи содержат интересующие Вас: знания, тела, земли, артефакты, элементы, друзей, врагов и многое другое,
 что будет использовано в Сплетении Древа Судьбы Вашего Мира, что Вы выстроите.
Для начала Вам нужно осознать новую Личность. Вы будете её контролировать пока у него есть Рассудок.
 Так же Вы всегда можете обратиться к Пласту Идей используя свою сознательную Волю.
Далее Вам нужно погрузиться воспоминания. Найти в глубинах памяти: что эта личность любит, что ненавидит и чем она уникальна, а так же её имя. Нужно обнаружить какова её основная стихия, какие навыки есть и ключевые переломные моменты судьбы.
(1. Выбор Идеи Тела, 2. Выбор Мотивации и Анти Мотивации, а так же бонуса. 3. Начало Выстраивания Идеи Нитей Судьбы. 4. За каждую единицу нити судьбы Вы получаете очки, которые можно тратить на развитие Навыков и Создание Магических Карт. )
Это копия моего Тела в другом мире. Таэмин. Вика... - Мизари. Мы вырастили эти тела в тонких мирах для защиты Человечества. И ведем борьбу на тонком плане. Скоро Вы тоже к нам и присоеденитесь.
`,
    },

    {
      text: `
      Ну начинайте. Погружайтесь в океан Идей. (Время рассмотреть)
Формирование Дерева Судьбы. За кажде Вплетение в него Вы получаете Нить Судьбы.  `,
    },


    {
      text: `
          Посмотрите на Идеи. Есть ли среди них Образы мест в которых бы Вы хотели побывать в Вашем путешествии, персонажи которых вы бы хотели встретить, 
          противники с которыми бы вы хотели померяться силами, навыки, заклинания или вещи. А так же цель которая удовлетворит чаянья Вашего Просящего. 
          `,
    },

    {
      text: `
(Теперь создадим свои первые заклинания)
Создание заклинания состоит из таких шагов:
1. Выбор Образа Идеи.
2. Описание Эффекта заклинания.
3. Ратификация эффекта заклинания: Редкость, манакост, Числовая формулировка эффекта,  Перезарядка. Потеря Воли или Нити Судьбы в соответствии со сложностью.
(Создание заклинания Новичка стоит 16 энергии, Ученика 64, Адепта 108, Эксперта 256, Мастера 1080) НС: 1,2,3...
(Возможно начать обучение и практику и закончить их позже в осколке сна, но для этого его нужно держать в памяти)  `,
    },
    {
      text: `
(Очки навыков)
Максимально количество очков навыков зависит от главенствующей для навыка характеристики (х*5)
Навыки можно припоминать в течении игрового процесса. 

`,
    },
    {
      text: `
      Сейчас мы в Лимбе(Междумирье)
Теперь начинайте Ваше путь. 
Достигая цели вы получаете бесценный опыт и мудрость, а Ваш подопечный в теле желаемое. 
Помните, наш мир гораздо весомее их миров от того Вы сильнее их всех. Ваша Воля это самое Важное, что у Вас есть. 
Теперь сформировав Древо Судьбы вмешиваються они (plist/SOI-142). Я не знаю кто они, Василиса говорит, что это Доля и Недоля из Славянской мифологии... прядильщицы судеб...
Желаю Вам удачи! Она Вам понадобиться. И на последок скажу. Уже долгое время не было новых Мироходцев. Вы очень нужны своему Миру. СЛАВА ЧЕЛОВЕЧЕСТВУ! `,
    },

    {
      text: `
        
        `,
    },
  ];

  return (
    <div className="flex justify-center  items-center ">
      <text className="mt-6">
        {arr.map((el, indx) => (
          <div key={indx} className="mx-6">
            <p>
              <span className="text-xl font-extrabold text-primary mr-3">
                {indx + 1}
              </span>
              {el.text}
            </p>
            <br />
          </div>
        ))}
      </text>
    </div>
  );
}
