import { cn } from "@/lib/utils";
import { Axe, Backpack, Book, Leaf, ScrollText } from "lucide-react";
import Link from "next/link";



export default function StartPg() {


    const arr = [
        { text:`
        
        Сны подвластны Вашей Воле. Каждый из Вас годами медитаций и ментальных усилий, научился преодолевать иллюзии снов заставив их подчиняться.
Но вскоре Вы узнали, что вы не одни такие. Не только Вы можете учиться, подселяться в тела и развивать своё сознание снами.
(каждому из Вас будет начислено очко бонусной характеристики после прохождения обучения: Оболочки, Знания (Интеллект), Ум (Восприятие), Чары (Харизма), Сила Воли)
Переломным моментом стала встреча Ваших друзей из снов в реальном мире.
(Знакомство: Имя, пару фактов о себе и как относишься к снам)
И вот Вы вновь встретились за столом, что бы помочь просящим. Сгенерировав их судьбы родить и(или) пожрать Кошмары и(или) Утопии пытающиеся окутать их.

Перед Вами Мир Идей. Идеи содержат интересующие Вас: знания, тела, земли, артефакты, элементы, друзей, врагов и многое другое, что будет использовано в Судьбе Персонажа.
Для начала Вам нужно создать Личность, что воззвала к Вашей помощи. Вы будете его контролировать пока у него есть Доверие к Вам.
Выберите стопку идей (по верхней идее), с которой вы будете работать. Так же Вы всегда можете обратиться к Верхней Идее Пласта Идей.

Далее Вам нужно погрузиться воспоминания. Найти в глубинах памяти: что эта личность любит, что ненавидит и чем она уникальна, а так же её имя. Нужно обнаружить какова её основная стихия, какие навыки есть и ключевые переломные моменты судьбы.
(1. Выбор Идеи Тела, 2. Выбор Мотивации и Анти Мотивации, а так же бонуса. 3. Начало Выстраивания Идеи Нитей Судьбы. 4. За каждую единицу нити судьбы Вы получаете очки, которые можно тратить на развитие Навыков и Создание Магических Карт. )

(Теперь создадим свои первые заклинания)
Создание заклинания состоит из таких шагов:
1. Выбор Образа Идеи.
2. Погружение в сон и оттачивание уровня умения в соответствии с доминирующей Характеристикой.
3. Ратификация эффекта заклинания и его перезарядки, потеря Воли в соответствии со сложностью.
(Создание заклинания Новичка стоит 16 энергии, Ученика 64, Адепта 108, Эксперта 256, Мастера 1080)
(Возможно начать обучение и практику и закончить их позже в осколке сна, но для этого его нужно держать в памяти)

(Очки навыков)
Максимально количество очков навыков зависит от главенствующей для навыка характеристики (х*5)
Навыки можно припоминать в течении игрового процесса.

(Формулировка общей цели)

Достигая цели вы получаете бесценный опыт и мудрость, а Ваш подопечный желаемое.

Теперь начинайте Ваше путешествие. Желаю Вам всем удачи!


        `},


        
        { text:`
        
        `},
        
    ]


    return (
        <div className="flex justify-center  items-center ">
            <text className="mt-6">
                {arr.map((el, indx) => (
                    <div key={indx} className="mx-6"><p ><span className="text-xl font-extrabold text-primary mr-3">{indx + 1}</span>{el.text}</p><br/></div>
                ))}
                
            
            </text>
        </div>  
    )
}